
Функция PingGETPing(Запрос)
	Возврат ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
КонецФункции

Функция SendPOSTSend(Запрос)   
	
	УстановитьПривилегированныйРежим(Истина);    
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
		
	Попытка  
		Ответ = ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
		// Ответ = Телеграм.ОбработатьВходящийЗапрос(Запрос);  // Не разобрался, как реализовать это 
	Исключение 
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ОбщегоНазначенияHTTP.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("bots.send", НачалоЗамера);	
	
	ОбщегоНазначенияHTTP.ЗаписьЛога("send", Запрос, Ответ);	
	
	Возврат Ответ;                                                                           
	
КонецФункции
